In [1]:
import numpy as np
import pandas as pd
from numpy.random import randn

In [20]:
np.random.seed(101)

In [21]:
randn(5,5)

array([[ 2.70684984,  0.62813271,  0.90796945,  0.50382575,  0.65111795],
       [-0.31931804, -0.84807698,  0.60596535, -2.01816824,  0.74012206],
       [ 0.52881349, -0.58900053,  0.18869531, -0.75887206, -0.93323722],
       [ 0.95505651,  0.19079432,  1.97875732,  2.60596728,  0.68350889],
       [ 0.30266545,  1.69372293, -1.70608593, -1.15911942, -0.13484072]])

In [22]:
df = pd.DataFrame(randn(7,5),['A','B','C','D','E','F','G'],['V','W','X','Y','Z'])

In [23]:
df

          V         W         X         Y         Z
A  0.390528  0.166905  0.184502  0.807706  0.072960
B  0.638787  0.329646 -0.497104 -0.754070 -0.943406
C  0.484752 -0.116773  1.901755  0.238127  1.996652
D -0.993263  0.196800 -1.136645  0.000366  1.025984
E -0.156598 -0.031579  0.649826  2.154846 -0.610259
F -0.755325 -0.346419  0.147027 -0.479448  0.558769
G  1.024810 -0.925874  1.862864 -1.133817  0.610478

In [24]:
# Selecting Col

In [25]:
df['V']

A    0.390528
B    0.638787
C    0.484752
D   -0.993263
E   -0.156598
F   -0.755325
G    1.024810
Name: V, dtype: float64

In [26]:
type(df['V'])

pandas.core.series.Series

In [27]:
type(df)

pandas.core.frame.DataFrame

In [28]:
ser = df.V

In [29]:
ser['D']

-0.993263499973366

In [30]:
df[['V','Z']]

          V         Z
A  0.390528  0.072960
B  0.638787 -0.943406
C  0.484752  1.996652
D -0.993263  1.025984
E -0.156598 -0.610259
F -0.755325  0.558769
G  1.024810  0.610478

In [31]:
df2= df[['V','Z']]

In [32]:
type(df2)

pandas.core.frame.DataFrame

In [33]:
df2

          V         Z
A  0.390528  0.072960
B  0.638787 -0.943406
C  0.484752  1.996652
D -0.993263  1.025984
E -0.156598 -0.610259
F -0.755325  0.558769
G  1.024810  0.610478

In [34]:
df['new']

KeyError: 'new'

In [36]:
df['new'] = df['V'] + df['W']

In [37]:
df

          V         W         X         Y         Z       new
A  0.390528  0.166905  0.184502  0.807706  0.072960  0.557432
B  0.638787  0.329646 -0.497104 -0.754070 -0.943406  0.968433
C  0.484752 -0.116773  1.901755  0.238127  1.996652  0.367978
D -0.993263  0.196800 -1.136645  0.000366  1.025984 -0.796464
E -0.156598 -0.031579  0.649826  2.154846 -0.610259 -0.188177
F -0.755325 -0.346419  0.147027 -0.479448  0.558769 -1.101744
G  1.024810 -0.925874  1.862864 -1.133817  0.610478  0.098936

In [39]:
df.drop('new')

KeyError: "['new'] not found in axis"

In [40]:
df.drop('new', axis=1)

          V         W         X         Y         Z
A  0.390528  0.166905  0.184502  0.807706  0.072960
B  0.638787  0.329646 -0.497104 -0.754070 -0.943406
C  0.484752 -0.116773  1.901755  0.238127  1.996652
D -0.993263  0.196800 -1.136645  0.000366  1.025984
E -0.156598 -0.031579  0.649826  2.154846 -0.610259
F -0.755325 -0.346419  0.147027 -0.479448  0.558769
G  1.024810 -0.925874  1.862864 -1.133817  0.610478

In [41]:
df

          V         W         X         Y         Z       new
A  0.390528  0.166905  0.184502  0.807706  0.072960  0.557432
B  0.638787  0.329646 -0.497104 -0.754070 -0.943406  0.968433
C  0.484752 -0.116773  1.901755  0.238127  1.996652  0.367978
D -0.993263  0.196800 -1.136645  0.000366  1.025984 -0.796464
E -0.156598 -0.031579  0.649826  2.154846 -0.610259 -0.188177
F -0.755325 -0.346419  0.147027 -0.479448  0.558769 -1.101744
G  1.024810 -0.925874  1.862864 -1.133817  0.610478  0.098936

In [43]:
df.drop('new', axis=1, inplace=True)

KeyError: "['new'] not found in axis"

In [44]:
df.drop('E')

          V         W         X         Y         Z
A  0.390528  0.166905  0.184502  0.807706  0.072960
B  0.638787  0.329646 -0.497104 -0.754070 -0.943406
C  0.484752 -0.116773  1.901755  0.238127  1.996652
D -0.993263  0.196800 -1.136645  0.000366  1.025984
F -0.755325 -0.346419  0.147027 -0.479448  0.558769
G  1.024810 -0.925874  1.862864 -1.133817  0.610478

In [45]:
df.drop('E',axis=0)

          V         W         X         Y         Z
A  0.390528  0.166905  0.184502  0.807706  0.072960
B  0.638787  0.329646 -0.497104 -0.754070 -0.943406
C  0.484752 -0.116773  1.901755  0.238127  1.996652
D -0.993263  0.196800 -1.136645  0.000366  1.025984
F -0.755325 -0.346419  0.147027 -0.479448  0.558769
G  1.024810 -0.925874  1.862864 -1.133817  0.610478

In [46]:
# Why the row = 0 and col = 1

In [47]:
df.shape

(7, 5)

In [48]:
#Selectiong Rows

In [49]:
df.loc['A']

V    0.390528
W    0.166905
X    0.184502
Y    0.807706
Z    0.072960
Name: A, dtype: float64

In [50]:
df.loc['C']

V    0.484752
W   -0.116773
X    1.901755
Y    0.238127
Z    1.996652
Name: C, dtype: float64

In [51]:
df.iloc[2]

V    0.484752
W   -0.116773
X    1.901755
Y    0.238127
Z    1.996652
Name: C, dtype: float64

In [52]:
df.loc['A','Z']

0.07295967531703869

In [53]:
df

          V         W         X         Y         Z
A  0.390528  0.166905  0.184502  0.807706  0.072960
B  0.638787  0.329646 -0.497104 -0.754070 -0.943406
C  0.484752 -0.116773  1.901755  0.238127  1.996652
D -0.993263  0.196800 -1.136645  0.000366  1.025984
E -0.156598 -0.031579  0.649826  2.154846 -0.610259
F -0.755325 -0.346419  0.147027 -0.479448  0.558769
G  1.024810 -0.925874  1.862864 -1.133817  0.610478

In [54]:
df.loc[['A','B'],['Y','Z']]

          Y         Z
A  0.807706  0.072960
B -0.754070 -0.943406

In [55]:
df

          V         W         X         Y         Z
A  0.390528  0.166905  0.184502  0.807706  0.072960
B  0.638787  0.329646 -0.497104 -0.754070 -0.943406
C  0.484752 -0.116773  1.901755  0.238127  1.996652
D -0.993263  0.196800 -1.136645  0.000366  1.025984
E -0.156598 -0.031579  0.649826  2.154846 -0.610259
F -0.755325 -0.346419  0.147027 -0.479448  0.558769
G  1.024810 -0.925874  1.862864 -1.133817  0.610478

In [57]:
df.to_csv('testing23.csv',index=False)

In [58]:
df.loc[['A','B','C'],['X','Y','Z']]

          X         Y         Z
A  0.184502  0.807706  0.072960
B -0.497104 -0.754070 -0.943406
C  1.901755  0.238127  1.996652

In [59]:
#Conditional


# Brackte Notation

In [60]:
df>0

       V      W      X      Y      Z
A   True   True   True   True   True
B   True   True  False  False  False
C   True  False   True   True   True
D  False   True  False   True   True
E  False  False   True   True  False
F  False  False   True  False   True
G   True  False   True  False   True

In [62]:
booldf=df>0

In [63]:
booldf

       V      W      X      Y      Z
A   True   True   True   True   True
B   True   True  False  False  False
C   True  False   True   True   True
D  False   True  False   True   True
E  False  False   True   True  False
F  False  False   True  False   True
G   True  False   True  False   True

In [64]:
df[booldf]

          V         W         X         Y         Z
A  0.390528  0.166905  0.184502  0.807706  0.072960
B  0.638787  0.329646       NaN       NaN       NaN
C  0.484752       NaN  1.901755  0.238127  1.996652
D       NaN  0.196800       NaN  0.000366  1.025984
E       NaN       NaN  0.649826  2.154846       NaN
F       NaN       NaN  0.147027       NaN  0.558769
G  1.024810       NaN  1.862864       NaN  0.610478

In [65]:
df[df>0]

          V         W         X         Y         Z
A  0.390528  0.166905  0.184502  0.807706  0.072960
B  0.638787  0.329646       NaN       NaN       NaN
C  0.484752       NaN  1.901755  0.238127  1.996652
D       NaN  0.196800       NaN  0.000366  1.025984
E       NaN       NaN  0.649826  2.154846       NaN
F       NaN       NaN  0.147027       NaN  0.558769
G  1.024810       NaN  1.862864       NaN  0.610478

In [66]:
df['W']>0

A     True
B     True
C    False
D     True
E    False
F    False
G    False
Name: W, dtype: bool

In [68]:
df['W']

A    0.166905
B    0.329646
C   -0.116773
D    0.196800
E   -0.031579
F   -0.346419
G   -0.925874
Name: W, dtype: float64

In [67]:
df[df['W']>0]

          V         W         X         Y         Z
A  0.390528  0.166905  0.184502  0.807706  0.072960
B  0.638787  0.329646 -0.497104 -0.754070 -0.943406
D -0.993263  0.196800 -1.136645  0.000366  1.025984

In [69]:
df

          V         W         X         Y         Z
A  0.390528  0.166905  0.184502  0.807706  0.072960
B  0.638787  0.329646 -0.497104 -0.754070 -0.943406
C  0.484752 -0.116773  1.901755  0.238127  1.996652
D -0.993263  0.196800 -1.136645  0.000366  1.025984
E -0.156598 -0.031579  0.649826  2.154846 -0.610259
F -0.755325 -0.346419  0.147027 -0.479448  0.558769
G  1.024810 -0.925874  1.862864 -1.133817  0.610478

In [70]:
df[df['Z']<1]

          V         W         X         Y         Z
A  0.390528  0.166905  0.184502  0.807706  0.072960
B  0.638787  0.329646 -0.497104 -0.754070 -0.943406
E -0.156598 -0.031579  0.649826  2.154846 -0.610259
F -0.755325 -0.346419  0.147027 -0.479448  0.558769
G  1.024810 -0.925874  1.862864 -1.133817  0.610478

In [71]:
df[df['W']>0]

          V         W         X         Y         Z
A  0.390528  0.166905  0.184502  0.807706  0.072960
B  0.638787  0.329646 -0.497104 -0.754070 -0.943406
D -0.993263  0.196800 -1.136645  0.000366  1.025984

In [72]:
newdf = df[df['W']>0]

In [73]:
newdf['Y']

A    0.807706
B   -0.754070
D    0.000366
Name: Y, dtype: float64

In [74]:
df[df['W']>0]['Y']

A    0.807706
B   -0.754070
D    0.000366
Name: Y, dtype: float64

In [75]:
df[df['W']>0]['Y']

A    0.807706
B   -0.754070
D    0.000366
Name: Y, dtype: float64

In [76]:
df[df['W']>0][['Y','Z']]

          Y         Z
A  0.807706  0.072960
B -0.754070 -0.943406
D  0.000366  1.025984

In [77]:
boolser = df['W']>0
dfresult = df[boolser]

In [78]:
dfresult

          V         W         X         Y         Z
A  0.390528  0.166905  0.184502  0.807706  0.072960
B  0.638787  0.329646 -0.497104 -0.754070 -0.943406
D -0.993263  0.196800 -1.136645  0.000366  1.025984

In [79]:
dfresult[['Y','Z']]

          Y         Z
A  0.807706  0.072960
B -0.754070 -0.943406
D  0.000366  1.025984

In [80]:
newcols=['Y','Z']
dfresult[newcols]

          Y         Z
A  0.807706  0.072960
B -0.754070 -0.943406
D  0.000366  1.025984

In [81]:
#More than one conditions

In [82]:
df[(df['W']>0) and (df['Z']>0)]

ValueError: The truth value of a Series is ambiguous. Use a.empty, a.bool(), a.item(), a.any() or a.all().

In [83]:
df[(df['W']>0) & (df['Z']>1)]

          V       W         X         Y         Z
D -0.993263  0.1968 -1.136645  0.000366  1.025984

In [84]:
True and False

False

In [85]:
df[(df['W']>0) | (df['Z']>1)]

          V         W         X         Y         Z
A  0.390528  0.166905  0.184502  0.807706  0.072960
B  0.638787  0.329646 -0.497104 -0.754070 -0.943406
C  0.484752 -0.116773  1.901755  0.238127  1.996652
D -0.993263  0.196800 -1.136645  0.000366  1.025984

In [86]:
# Index

In [87]:
df

          V         W         X         Y         Z
A  0.390528  0.166905  0.184502  0.807706  0.072960
B  0.638787  0.329646 -0.497104 -0.754070 -0.943406
C  0.484752 -0.116773  1.901755  0.238127  1.996652
D -0.993263  0.196800 -1.136645  0.000366  1.025984
E -0.156598 -0.031579  0.649826  2.154846 -0.610259
F -0.755325 -0.346419  0.147027 -0.479448  0.558769
G  1.024810 -0.925874  1.862864 -1.133817  0.610478

In [88]:
df.reset_index()

  index         V         W         X         Y         Z
0     A  0.390528  0.166905  0.184502  0.807706  0.072960
1     B  0.638787  0.329646 -0.497104 -0.754070 -0.943406
2     C  0.484752 -0.116773  1.901755  0.238127  1.996652
3     D -0.993263  0.196800 -1.136645  0.000366  1.025984
4     E -0.156598 -0.031579  0.649826  2.154846 -0.610259
5     F -0.755325 -0.346419  0.147027 -0.479448  0.558769
6     G  1.024810 -0.925874  1.862864 -1.133817  0.610478

In [89]:
newindex = 'JS PY DS CS ML AI DB'.split()

In [90]:
newindex

['JS', 'PY', 'DS', 'CS', 'ML', 'AI', 'DB']

In [91]:
df['Courses'] = newindex

In [92]:
df

          V         W         X         Y         Z Courses
A  0.390528  0.166905  0.184502  0.807706  0.072960      JS
B  0.638787  0.329646 -0.497104 -0.754070 -0.943406      PY
C  0.484752 -0.116773  1.901755  0.238127  1.996652      DS
D -0.993263  0.196800 -1.136645  0.000366  1.025984      CS
E -0.156598 -0.031579  0.649826  2.154846 -0.610259      ML
F -0.755325 -0.346419  0.147027 -0.479448  0.558769      AI
G  1.024810 -0.925874  1.862864 -1.133817  0.610478      DB

In [93]:
df.set_index('Courses')

                V         W         X         Y         Z
Courses
JS       0.390528  0.166905  0.184502  0.807706  0.072960
PY       0.638787  0.329646 -0.497104 -0.754070 -0.943406
DS       0.484752 -0.116773  1.901755  0.238127  1.996652
CS      -0.993263  0.196800 -1.136645  0.000366  1.025984
ML      -0.156598 -0.031579  0.649826  2.154846 -0.610259
AI      -0.755325 -0.346419  0.147027 -0.479448  0.558769
DB       1.024810 -0.925874  1.862864 -1.133817  0.610478

In [ ]:
#index Levels

In [94]:
outside = 'DS1 DS1 DS1 DS2 DS2 DS2'.split()
outside

['DS1', 'DS1', 'DS1', 'DS2', 'DS2', 'DS2']

In [95]:
inside = [1,2,3,1,2,3]
inside

[1, 2, 3, 1, 2, 3]

In [96]:
hier_index = list(zip(outside, inside))
hier_index

[('DS1', 1), ('DS1', 2), ('DS1', 3), ('DS2', 1), ('DS2', 2), ('DS2', 3)]

In [98]:
hier_index = pd.MultiIndex.from_tuples(hier_index)

In [99]:
hier_index

MultiIndex([('DS1', 1),
            ('DS1', 2),
            ('DS1', 3),
            ('DS2', 1),
            ('DS2', 2),
            ('DS2', 3)],
           )

In [100]:
df = pd.DataFrame(randn(6,2),hier_index,['A','B'])

In [101]:
df

              A         B
DS1 1  0.386030  2.084019
    2 -0.376519  0.230336
    3  0.681209  1.035125
DS2 1 -0.031160  1.939932
    2 -1.005187 -0.741790
    3  0.187125 -0.732845

In [102]:
df.loc['DS1']

          A         B
1  0.386030  2.084019
2 -0.376519  0.230336
3  0.681209  1.035125

In [103]:
df.loc['DS1'].iloc[1]

A   -0.376519
B    0.230336
Name: 2, dtype: float64

In [104]:
df.index.names

FrozenList([None, None])

In [105]:
df.index.names = ['Course','Id']

In [106]:
df.index.names

FrozenList(['Course', 'Id'])

In [107]:
df

                  A         B
Course Id
DS1    1   0.386030  2.084019
       2  -0.376519  0.230336
       3   0.681209  1.035125
DS2    1  -0.031160  1.939932
       2  -1.005187 -0.741790
       3   0.187125 -0.732845

In [108]:
df.loc['DS2']

           A         B
Id
1  -0.031160  1.939932
2  -1.005187 -0.741790
3   0.187125 -0.732845

In [109]:
df.loc['DS2'].loc[2]

A   -1.005187
B   -0.741790
Name: 2, dtype: float64

In [110]:
df.loc['DS2'].loc[2].iloc[1]

-0.7417897046689249

In [111]:
df.loc['DS2'].loc[2][1]

-0.7417897046689249

In [112]:
df.loc['DS2'].loc[2]['B']

-0.7417897046689249

In [113]:
df

                  A         B
Course Id
DS1    1   0.386030  2.084019
       2  -0.376519  0.230336
       3   0.681209  1.035125
DS2    1  -0.031160  1.939932
       2  -1.005187 -0.741790
       3   0.187125 -0.732845

In [114]:
#croos section

In [115]:
df.loc['DS1']

           A         B
Id
1   0.386030  2.084019
2  -0.376519  0.230336
3   0.681209  1.035125

In [116]:
df.xs('DS1')

           A         B
Id
1   0.386030  2.084019
2  -0.376519  0.230336
3   0.681209  1.035125

In [117]:
df.xs(1, level='Id')

              A         B
Course
DS1     0.38603  2.084019
DS2    -0.03116  1.939932

In [118]:
# Missing Data

In [119]:
data = {'A':[1,2,np.nan, 3], 'B':[5, np.nan, np.nan, np.nan], 'C':[1,2,3,4]}

In [120]:
df = pd.DataFrame(data)

In [121]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3
3  3.0  NaN  4

In [122]:
df.dropna()

     A    B  C
0  1.0  5.0  1

In [123]:
df.dropna(axis=1)

   C
0  1
1  2
2  3
3  4

In [124]:
df.dropna(thresh=2)

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
3  3.0  NaN  4

In [125]:
# Fill na

In [126]:
df.fillna(value='Fill')

      A     B  C
0   1.0   5.0  1
1   2.0  Fill  2
2  Fill  Fill  3
3   3.0  Fill  4

In [127]:
df.fillna(value=2)

     A    B  C
0  1.0  5.0  1
1  2.0  2.0  2
2  2.0  2.0  3
3  3.0  2.0  4

In [128]:
df['A'].fillna(value=df['A'].mean())

0    1.0
1    2.0
2    2.0
3    3.0
Name: A, dtype: float64

In [ ]:
#Groupby

In [129]:
data = {
    'Courses':['Python','Python','javaScript','javaScript','data Science','data Science'],
    'Student':['John ','Doe ','Emmy ','Mike ','Sarah ','Andy'],
    'points':[95,90,89,98,100,94]
}

In [130]:
 df = pd.DataFrame(data)

In [131]:
df

        Courses Student  points
0        Python   John       95
1        Python    Doe       90
2    javaScript   Emmy       89
3    javaScript   Mike       98
4  data Science  Sarah      100
5  data Science    Andy      94

In [132]:
df.groupby(['Courses']).mean(numeric_only=True)

              points
Courses
Python          92.5
data Science    97.0
javaScript      93.5

In [133]:
byCourse = df.groupby(['Courses'])

In [134]:
byCourse

In [135]:
byCourse.mean(numeric_only=True)

              points
Courses
Python          92.5
data Science    97.0
javaScript      93.5

In [137]:
byCourse.sum()

                 Student  points
Courses
Python         John Doe      185
data Science  Sarah Andy     194
javaScript    Emmy Mike      187

In [136]:
byCourse.sum().loc['Python']

Student    John Doe
points           185
Name: Python, dtype: object

In [138]:
df.groupby('Courses').sum().loc['Python']

Student    John Doe
points           185
Name: Python, dtype: object

In [ ]:
byCourse.count()

In [ ]:
byCourse.max()

In [ ]:
byCourse.min()

In [ ]:
df.groupby('Courses').describe()

In [ ]:
df.groupby('Courses').describe().transpose()

In [ ]:
#Merging Joining and Concatenating

In [ ]:
df1 = pd.DataFrame({
                   'A':['A0','A1','A2','A3'],
                   'B':['B0','B1','B2','B3'],
                   'C':['C0','C1','C2','C3'],
                   'D':['D0','D2','D2','D3']},
                    index=[0,1,2,3])

In [ ]:
df2 = pd.DataFrame({
                   'A':['A4','A5','A6','A7'],
                   'B':['B4','B5','B6','B7'],
                   'C':['C4','C5','C6','C7'],
                   'D':['D4','D5','D6','D7']},
                     index=[4,5,6,7])

In [ ]:
df3 = pd.DataFrame({
                   'A':['A8','A9','A10','A11'],
                   'B':['B8','B9','B10','B11'],
                   'C':['C8','C9','C10','C11'],
                   'D':['D8','D9','D10','D11']},
                     index=[8,9,10,11])

In [ ]:
df1

In [ ]:
df2

In [ ]:
df3

# Concatention
Concatention basically glues together DataFrames. Keep in mind that dimensions should match along the axis you are concatenating on. You can use pd.concat and pass in a list of DataFrames to concatnate together:

In [ ]:
pd.concat([df1,df2,df3])

In [ ]:
pd.concat([df1,df2,df3], axis=1)

# DataFram

In [3]:
left = pd.DataFrame({
                   'data':['G0','G1','G2','G3'],
                    'A':['A8','A9','A10','A11'],
                   'B':['B8','B9','B10','B11']})

In [4]:
right = pd.DataFrame({
                    'data':['G0','G1','G2','G3'],
                   'C':['C8','C9','C10','C11'],
                   'D':['D8','D9','D10','D11']})

In [5]:
left

  data    A    B
0   G0   A8   B8
1   G1   A9   B9
2   G2  A10  B10
3   G3  A11  B11

In [6]:
right

  data    C    D
0   G0   C8   D8
1   G1   C9   D9
2   G2  C10  D10
3   G3  C11  D11

# Merging

In [7]:
pd.merge(left,right,how='inner',on='data')

  data    A    B    C    D
0   G0   A8   B8   C8   D8
1   G1   A9   B9   C9   D9
2   G2  A10  B10  C10  D10
3   G3  A11  B11  C11  D11

In [8]:
left = pd.DataFrame({
                   'data1':['G0','G0','G1','G2'],
                    'data2':['G0','G1','G0','G1'],
                    'A':['A0','A1','A2','A3'],
                   'B':['B0','B1','B2','B3']})

In [9]:
right = pd.DataFrame({
                   'data1':['G0','G1','G1','G2'],
                    'data2':['G0','G0','G0','G0'],
                   'C':['C0','C1','C2','C3'],
                   'D':['D0','D2','D2','D3']})

In [10]:
pd.merge(left,right,on=['data1','data2'])

  data1 data2   A   B   C   D
0    G0    G0  A0  B0  C0  D0
1    G1    G0  A2  B2  C1  D2
2    G1    G0  A2  B2  C2  D2

In [11]:
pd.merge(left,right,how='outer',on=['data1','data2'])

  data1 data2    A    B    C    D
0    G0    G0   A0   B0   C0   D0
1    G0    G1   A1   B1  NaN  NaN
2    G1    G0   A2   B2   C1   D2
3    G1    G0   A2   B2   C2   D2
4    G2    G1   A3   B3  NaN  NaN
5    G2    G0  NaN  NaN   C3   D3

In [12]:
pd.merge(left,right,how='right',on=['data1','data2'])

  data1 data2    A    B   C   D
0    G0    G0   A0   B0  C0  D0
1    G1    G0   A2   B2  C1  D2
2    G1    G0   A2   B2  C2  D2
3    G2    G0  NaN  NaN  C3  D3

# Joining

In [ ]:
left = pd.DataFrame({
                   'A':['A0','A1','A2'],
                   'B':['B0','B1','B2']},
                     index=['k0','k1','k2'])

In [ ]:
right = pd.DataFrame({
                  
                   'C':['C0','C2','C3'],
                   'D':['D0','D2','D3']},
                     index=['k0','k1','k2'])

In [ ]:
left.join(right)

In [ ]:
left.join(right, how='outer')

# Operations

In [ ]:
df = pd.DataFrame({
    'col1':[1,2,3,4],
    'col2':[222,333,555,222],
    'col3':['abc','def','fig','asd']
})

In [ ]:
df.head()

In [ ]:
df['col2']

In [ ]:
df['col2'].unique()

In [ ]:
df['col2'].nunique()

In [ ]:
len(df['col2'].unique())

In [ ]:
df['col2'].value_counts()

In [ ]:
#Selecting Data

In [ ]:
df[df['col1']>2]

In [ ]:
df['col1']>2

In [ ]:
df[(df['col1']>2) & (df['col2']==222)]

In [ ]:
# Apply Methode

In [ ]:
df['col1'].sum()

In [ ]:
def times3(y):
    return y*3

In [ ]:
df['col1'].apply(times3)

In [ ]:
df['col3'].apply(len)

In [ ]:
df['col3'].apply(lambda x: x.upper())

In [ ]:
df['col1'].apply(lambda i: i*5)

In [ ]:
# Removing col

In [ ]:
df.drop('col1', axis=1)

In [ ]:
df

In [ ]:
# Getting Names

In [ ]:
df.columns

In [ ]:
df.index

In [ ]:
# Sorting

In [ ]:
df.sort_values('col2')

In [ ]:
df.sort_values(by='col2')

In [ ]:
df.isnull()

In [ ]:
data = {
    'A':['foo','foo','foo','bar','bar','bar'],
    'B':['one','one','two','two','one','one'],
    'C':['x','y','x','y','x','y'],
    'D':[1,3,2,5,4,1]
}

In [ ]:
df = pd.DataFrame(data)

In [ ]:
df

In [ ]:
df.pivot_table(values='D', index=['A','B'],columns=['C'])

In [ ]:
# Input and OutPut

In [5]:
df = pd.DataFrame(randn(4,3),['A','B','C','D'],['X','Y','Z'])

NameError: name 'pd' is not defined

In [16]:
df

        Courses Student  points
0        Python   John       95
1        Python    Doe       90
2    javaScript   Emmy       89
3    javaScript   Mike       98
4  data Science  Sarah      100
5  data Science    Andy      94

In [17]:
df.to_csv('example.csv', index=False)

In [18]:
df = pd.read_csv('example.csv')

In [19]:
df

        Courses Student  points
0        Python   John       95
1        Python    Doe       90
2    javaScript   Emmy       89
3    javaScript   Mike       98
4  data Science  Sarah      100
5  data Science    Andy      94

In [31]:
df.to_csv('example.csv', index=False)

In [36]:
#df.to_excel('examplew.xlxs', index=False)

In [39]:
data = pd.read_html('https://www.fdic.gov/resources/resolutions/bank-failures/failed-bank-list/')

In [41]:
data

[                             Bank NameBank       CityCity StateSt  CertCert  \
 0    Republic First Bank dba Republic Bank   Philadelphia      PA     27332
 1                            Citizens Bank       Sac City      IA      8758
 2                 Heartland Tri-State Bank        Elkhart      KS     25851
 3                      First Republic Bank  San Francisco      CA     59017
 4                           Signature Bank       New York      NY     57053
 ..                                     ...            ...     ...       ...
 564                     Superior Bank, FSB       Hinsdale      IL     32646
 565                    Malta National Bank          Malta      OH      6629
 566        First Alliance Bank & Trust Co.     Manchester      NH     34264
 567      National State Bank of Metropolis     Metropolis      IL      3815
 568                       Bank of Honolulu       Honolulu      HI     21029

                  Acquiring InstitutionAI Closing DateClosing  FundFund
 0      Fulton Bank, National Association      April 26, 2024     10546
 1              Iowa Trust & Savings Bank    November 3, 2023     10545
 2                 Dream First Bank, N.A.       July 28, 2023     10544
 3              JPMorgan Chase Bank, N.A.         May 1, 2023     10543
 4                    Flagstar Bank, N.A.      March 12, 2023     10540
 ..                                   ...                 ...       ...
 564                Superior Federal, FSB       July 27, 2001      6004
 565                    North Valley Bank         May 3, 2001      4648
 566  Southern New Hampshire Bank & Trust    February 2, 2001      4647
 567              Banterra Bank of Marion   December 14, 2000      4646
 568                   Bank of the Orient    October 13, 2000      4645

 [569 rows x 7 columns]]

In [43]:
type(data)

list

In [45]:
data[0]

,Bank NameBank,CityCity,StateSt,CertCert,Acquiring InstitutionAI,Closing DateClosing,FundFund
0,Republic First Bank dba Republic Bank,Philadelphia,PA,27332,"Fulton Bank, National Association","April 26, 2024",10546
1,Citizens Bank,Sac City,IA,8758,Iowa Trust & Savings Bank,"November 3, 2023",10545
2,Heartland Tri-State Bank,Elkhart,KS,25851,"Dream First Bank, N.A.","July 28, 2023",10544
3,First Republic Bank,San Francisco,CA,59017,"JPMorgan Chase Bank, N.A.","May 1, 2023",10543
4,Signature Bank,New York,NY,57053,"Flagstar Bank, N.A.","March 12, 2023",10540
...,...,...,...,...,...,...,...
564,"Superior Bank, FSB",Hinsdale,IL,32646,"Superior Federal, FSB","July 27, 2001",6004
565,Malta National Bank,Malta,OH,6629,North Valley Bank,"May 3, 2001",4648
566,First Alliance Bank & Trust Co.,Manchester,NH,34264,Southern New Hampshire Bank & Trust,"February 2, 2001",4647
567,National State Bank of Metropolis,Metropolis,IL,3815,Banterra Bank of Marion,"December 14, 2000",4646
568,Bank of Honolulu,Honolulu,HI,21029,Bank of the Orient,"October 13, 2000",4645

In [48]:
data[0].head(20)

,Bank NameBank,CityCity,StateSt,CertCert,Acquiring InstitutionAI,Closing DateClosing,FundFund
0,Republic First Bank dba Republic Bank,Philadelphia,PA,27332,"Fulton Bank, National Association","April 26, 2024",10546
1,Citizens Bank,Sac City,IA,8758,Iowa Trust & Savings Bank,"November 3, 2023",10545
2,Heartland Tri-State Bank,Elkhart,KS,25851,"Dream First Bank, N.A.","July 28, 2023",10544
3,First Republic Bank,San Francisco,CA,59017,"JPMorgan Chase Bank, N.A.","May 1, 2023",10543
4,Signature Bank,New York,NY,57053,"Flagstar Bank, N.A.","March 12, 2023",10540
5,Silicon Valley Bank,Santa Clara,CA,24735,FirstCitizens Bank & Trust Company,"March 10, 2023",10539
6,Almena State Bank,Almena,KS,15426,Equity Bank,"October 23, 2020",10538
7,First City Bank of Florida,Fort Walton Beach,FL,16748,"United Fidelity Bank, fsb","October 16, 2020",10537
8,The First State Bank,Barboursville,WV,14361,"MVB Bank, Inc.","April 3, 2020",10536
9,Ericson State Bank,Ericson,NE,18265,Farmers and Merchants Bank,"February 14, 2020",10535
10,City National Bank of New Jersey,Newark,NJ,21111,Industrial Bank,"November 1, 2019",10534
11,Resolute Bank,Maumee,OH,58317,Buckeye State Bank,"October 25, 2019",10533
12,Louisa Community Bank,Louisa,KY,58112,Kentucky Farmers Bank Corporation,"October 25, 2019",10532
13,The Enloe State Bank,Cooper,TX,10716,"Legend Bank, N. A.","May 31, 2019",10531
14,Washington Federal Bank for Savings,Chicago,IL,30570,Royal Savings Bank,"December 15, 2017",10530
15,The Farmers and Merchants State Bank of Argonia,Argonia,KS,17719,Conway Bank,"October 13, 2017",10529
16,Fayette County Bank,Saint Elmo,IL,1802,"United Fidelity Bank, fsb","May 26, 2017",10528
17,"Guaranty Bank, (d/b/a BestBank in Georgia & Mi...",Milwaukee,WI,30003,First-Citizens Bank & Trust Company,"May 5, 2017",10527
18,First NBC Bank,New Orleans,LA,58302,Whitney Bank,"April 28, 2017",10526
19,Proficio Bank,Cottonwood Heights,UT,35495,Cache Valley Bank,"March 3, 2017",10525

In [79]:
df = pd.DataFrame(data[0])

In [80]:
df[['Bank NameBank','Closing DateClosing']]

                             Bank NameBank Closing DateClosing
0    Republic First Bank dba Republic Bank      April 26, 2024
1                            Citizens Bank    November 3, 2023
2                 Heartland Tri-State Bank       July 28, 2023
3                      First Republic Bank         May 1, 2023
4                           Signature Bank      March 12, 2023
..                                     ...                 ...
564                     Superior Bank, FSB       July 27, 2001
565                    Malta National Bank         May 3, 2001
566        First Alliance Bank & Trust Co.    February 2, 2001
567      National State Bank of Metropolis   December 14, 2000
568                       Bank of Honolulu    October 13, 2000

[569 rows x 2 columns]

In [83]:
df.drop('StateSt', axis=1)

,Bank NameBank,CityCity,CertCert,Acquiring InstitutionAI,Closing DateClosing,FundFund
0,Republic First Bank dba Republic Bank,Philadelphia,27332,"Fulton Bank, National Association","April 26, 2024",10546
1,Citizens Bank,Sac City,8758,Iowa Trust & Savings Bank,"November 3, 2023",10545
2,Heartland Tri-State Bank,Elkhart,25851,"Dream First Bank, N.A.","July 28, 2023",10544
3,First Republic Bank,San Francisco,59017,"JPMorgan Chase Bank, N.A.","May 1, 2023",10543
4,Signature Bank,New York,57053,"Flagstar Bank, N.A.","March 12, 2023",10540
...,...,...,...,...,...,...
564,"Superior Bank, FSB",Hinsdale,32646,"Superior Federal, FSB","July 27, 2001",6004
565,Malta National Bank,Malta,6629,North Valley Bank,"May 3, 2001",4648
566,First Alliance Bank & Trust Co.,Manchester,34264,Southern New Hampshire Bank & Trust,"February 2, 2001",4647
567,National State Bank of Metropolis,Metropolis,3815,Banterra Bank of Marion,"December 14, 2000",4646
568,Bank of Honolulu,Honolulu,21029,Bank of the Orient,"October 13, 2000",4645